Hi, @davedomainx, thanks for your words and the feedback, sorry for the late reply due to the weekend. Terraform is a parallel system, that means when Terraform walks the dependency tree, it will create as many resources in parallel as it can, so terraform can figure out the most efficient way to make it happen.  This also results in that when multiple resources of the same type are submitted, if there is no dependency between them, they will be submitted to the device in a random order. But we can make them be submitted to the device in order through dependencies. According to your description: "my Terraform code is not fully one-shot clean",  the problem can be solved by Terraform's depends_on feature, which includes 'depends_on for resource' and 'depends_on for modules' (supported in terraform0.13). For example, let's suppose there are the following modules:

```
├── m1
│   └── m1.tf
├── m2
│   └── m2.tf
├── m3
│   └── m3.tf
└── main
    └── root.tf
```
Module m1 will create policies with policyid 1,2,3, m2 will create policies 4,5,6, and m3 will create policies 7,8,9. If we want them to be submitted to the device in the order of 1, 2, 3, 4, 5, 6, 7, 8, 9,  the configuration is as follows:

```
# cd main/
# cat ../m1/m1.tf
resource "fortios_firewall_policy" "trname1" {
  action   = "accept"
  name     = "policy1"
  policyid = 1
  status   = "enable"

  dstaddr {
    name = "all"
  }

  dstintf {
    name = "port4"
  }

  service {
    name = "HTTP"
  }

  srcaddr {
    name = "all"
  }

  srcintf {
    name = "port3"
  }
}

resource "fortios_firewall_policy" "trname2" {
  action   = "accept"
  name     = "policy2"
  policyid = 2
  status   = "enable"

  dstaddr {
    name = "swscan.apple.com"
  }

  dstintf {
    name = "port2"
  }

  service {
    name = "AFS3"
  }

  srcaddr {
    name = "myaddress"
  }

  srcintf {
    name = "port1"
  }

  depends_on = [
    fortios_firewall_policy.trname1
  ]
}

resource "fortios_firewall_policy" "trname3" {
  action   = "accept"
  name     = "policy3"
  policyid = 3
  status   = "enable"

  dstaddr {
    name = "all"
  }

  dstintf {
    name = "port2"
  }

  service {
    name = "ALL_TCP"
  }

  srcaddr {
    name = "myaddress"
  }

  srcintf {
    name = "port1"
  }

  depends_on = [
    fortios_firewall_policy.trname2
  ]
}

output "m1output" {
  value = "m1 output"

  depends_on = [
    fortios_firewall_policy.trname3
  ]
}

# cat ../m2/m2.tf

resource "fortios_firewall_policy" "trname4" {
  action   = "accept"
  name     = "policy4"
  policyid = 4
  status   = "enable"

  dstaddr {
    name = "swscan.apple.com"
  }

  dstintf {
    name = "port2"
  }

  service {
    name = "ALL_ICMP"
  }

  srcaddr {
    name = "google-play"
  }

  srcintf {
    name = "port1"
  }
}

resource "fortios_firewall_policy" "trname5" {
  action   = "accept"
  name     = "policy5"
  policyid = 5
  status   = "enable"

  dstaddr {
    name = "autoupdate.opera.com"
  }

  dstintf {
    name = "port3"
  }

  service {
    name = "ALL_TCP"
  }

  srcaddr {
    name = "myaddress"
  }

  srcintf {
    name = "port1"
  }

  depends_on = [
    fortios_firewall_policy.trname4
  ]
}

resource "fortios_firewall_policy" "trname6" {
  action   = "accept"
  name     = "policy6"
  policyid = 6
  status   = "enable"

  dstaddr {
    name = "all"
  }

  dstintf {
    name = "port2"
  }

  service {
    name = "ALL_TCP"
  }

  srcaddr {
    name = "autoupdate.opera.com"
  }

  srcintf {
    name = "port2"
  }

  depends_on = [
    fortios_firewall_policy.trname5
  ]
}

output "m2output" {
  value = "m2 output"

  depends_on = [
    fortios_firewall_policy.trname5
  ]
}


# cat ../m3/m3.tf
resource "fortios_firewall_policy" "trname7" {
  action   = "accept"
  name     = "policy7"
  policyid = 7
  status   = "enable"

  dstaddr {
    name = "swscan.apple.com"
  }

  dstintf {
    name = "port2"
  }

  service {
    name = "ALL_TCP"
  }

  srcaddr {
    name = "google-play"
  }

  srcintf {
    name = "port1"
  }
}

resource "fortios_firewall_policy" "trname8" {
  action   = "accept"
  name     = "policy8"
  policyid = 8
  status   = "enable"

  dstaddr {
    name = "autoupdate.opera.com"
  }

  dstintf {
    name = "port3"
  }

  service {
    name = "ALL_ICMP"
  }

  srcaddr {
    name = "myaddress"
  }

  srcintf {
    name = "port1"
  }

  depends_on = [
    fortios_firewall_policy.trname7
  ]
}

resource "fortios_firewall_policy" "trname9" {
  action   = "accept"
  name     = "policy9"
  policyid = 9
  status   = "enable"

  dstaddr {
    name = "all"
  }

  dstintf {
    name = "port2"
  }

  service {
    name = "ALL_ICMP"
  }

  srcaddr {
    name = "autoupdate.opera.com"
  }

  srcintf {
    name = "port2"
  }

  depends_on = [
    fortios_firewall_policy.trname8
  ]
}

output "m3output" {
  value = "m3 output"

  depends_on = [
    fortios_firewall_policy.trname9
  ]
}

```
Note the depends_on between resources.

```

# cat root.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token = "rGqsgj9Qmh3dwfQdc8hd3t3G6xG3N5" # 6.2.0
  insecure = "true"
}

module "m1" {
  source = "../m1"
}

module "m2" {
  source = "../m2"
  depends_on = [
    module.m1
  ]
}

module "m3" {
  source = "../m3"
  depends_on = [
    module.m2
  ]
}

```
Note the depends_on between modules.

```
# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.m1.fortios_firewall_policy.trname1 will be created
  + resource "fortios_firewall_policy" "trname1" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy1"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 1
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "all"
        }

      + dstintf {
          + name = "port4"
        }

      + service {
          + name = "HTTP"
        }

      + srcaddr {
          + name = "all"
        }

      + srcintf {
          + name = "port3"
        }
    }

  # module.m1.fortios_firewall_policy.trname2 will be created
  + resource "fortios_firewall_policy" "trname2" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy2"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 2
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "swscan.apple.com"
        }

      + dstintf {
          + name = "port2"
        }

      + service {
          + name = "AFS3"
        }

      + srcaddr {
          + name = "myaddress"
        }

      + srcintf {
          + name = "port1"
        }
    }

  # module.m1.fortios_firewall_policy.trname3 will be created
  + resource "fortios_firewall_policy" "trname3" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy3"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 3
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "all"
        }

      + dstintf {
          + name = "port2"
        }

      + service {
          + name = "ALL_TCP"
        }

      + srcaddr {
          + name = "myaddress"
        }

      + srcintf {
          + name = "port1"
        }
    }

  # module.m2.fortios_firewall_policy.trname4 will be created
  + resource "fortios_firewall_policy" "trname4" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy4"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 4
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "swscan.apple.com"
        }

      + dstintf {
          + name = "port2"
        }

      + service {
          + name = "ALL_ICMP"
        }

      + srcaddr {
          + name = "google-play"
        }

      + srcintf {
          + name = "port1"
        }
    }

  # module.m2.fortios_firewall_policy.trname5 will be created
  + resource "fortios_firewall_policy" "trname5" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy5"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 5
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "autoupdate.opera.com"
        }

      + dstintf {
          + name = "port3"
        }

      + service {
          + name = "ALL_TCP"
        }

      + srcaddr {
          + name = "myaddress"
        }

      + srcintf {
          + name = "port1"
        }
    }

  # module.m2.fortios_firewall_policy.trname6 will be created
  + resource "fortios_firewall_policy" "trname6" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy6"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 6
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "all"
        }

      + dstintf {
          + name = "port2"
        }

      + service {
          + name = "ALL_TCP"
        }

      + srcaddr {
          + name = "autoupdate.opera.com"
        }

      + srcintf {
          + name = "port2"
        }
    }

  # module.m3.fortios_firewall_policy.trname7 will be created
  + resource "fortios_firewall_policy" "trname7" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy7"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 7
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "swscan.apple.com"
        }

      + dstintf {
          + name = "port2"
        }

      + service {
          + name = "ALL_TCP"
        }

      + srcaddr {
          + name = "google-play"
        }

      + srcintf {
          + name = "port1"
        }
    }

  # module.m3.fortios_firewall_policy.trname8 will be created
  + resource "fortios_firewall_policy" "trname8" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy8"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 8
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "autoupdate.opera.com"
        }

      + dstintf {
          + name = "port3"
        }

      + service {
          + name = "ALL_ICMP"
        }

      + srcaddr {
          + name = "myaddress"
        }

      + srcintf {
          + name = "port1"
        }
    }

  # module.m3.fortios_firewall_policy.trname9 will be created
  + resource "fortios_firewall_policy" "trname9" {
      + action                      = "accept"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + name                        = "policy9"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 9
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = (known after apply)
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "all"
        }

      + dstintf {
          + name = "port2"
        }

      + service {
          + name = "ALL_ICMP"
        }

      + srcaddr {
          + name = "autoupdate.opera.com"
        }

      + srcintf {
          + name = "port2"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.m1.fortios_firewall_policy.trname1: Creating...
module.m1.fortios_firewall_policy.trname1: Creation complete after 0s [id=1]
module.m1.fortios_firewall_policy.trname2: Creating...
module.m1.fortios_firewall_policy.trname2: Creation complete after 0s [id=2]
module.m1.fortios_firewall_policy.trname3: Creating...
module.m1.fortios_firewall_policy.trname3: Creation complete after 0s [id=3]
module.m2.fortios_firewall_policy.trname4: Creating...
module.m2.fortios_firewall_policy.trname4: Creation complete after 0s [id=4]
module.m2.fortios_firewall_policy.trname5: Creating...
module.m2.fortios_firewall_policy.trname5: Creation complete after 0s [id=5]
module.m2.fortios_firewall_policy.trname6: Creating...
module.m2.fortios_firewall_policy.trname6: Creation complete after 0s [id=6]
module.m3.fortios_firewall_policy.trname7: Creating...
module.m3.fortios_firewall_policy.trname7: Creation complete after 0s [id=7]
module.m3.fortios_firewall_policy.trname8: Creating...
module.m3.fortios_firewall_policy.trname8: Creation complete after 0s [id=8]
module.m3.fortios_firewall_policy.trname9: Creating...
module.m3.fortios_firewall_policy.trname9: Creation complete after 0s [id=9]

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.
```

We can find that these policies have been submitted to the device in the order of 1, 2, 3, 4, 5, 6, 7, 8, 9.

![22](https://user-images.githubusercontent.com/49291382/96423765-5fcc0800-122c-11eb-8255-d7292d9a4a76.png)


**Q @davedomainx **: _Is there any way to automatically naturally order the policies by Policy ID number ? You can manually re-order it in the GUI and with fortios_firewall_security_policyseq. It feels like there should be an option in the GUI/CLI etc to automatically order by PolicyID number, but I don't see an option to do this._
**A**: According to what I know, FortiGate does not seem to provide the feature of automatically sorting policies by Policyid. But your suggestion is really good, and we consider implementing the feature of sorting by policyid in the provider. This will take some time to design and test, it should be released after 2-3 releases.  Hope this helps! Thank you!
